'''
Даны два числа n и m. Создайте двумерный массив [n][m] и заполните его по следующим правилам: 
Числа, стоящие в строке 0 или в столбце 0 равны 1 (A[0][j]=1, A[i][0]=1). Для всех остальных элементов массива A[i][j]=A[i-1][j]+A[i][j-1], то есть каждый элемент равен сумме двух элементов, стоящих слева и сверху от него.

Входные данные
Программа получает на вход два числа n и m.

Выходные данные
Выведите данный массив.

'''

inputData = input().split()
n = int(inputData[0])
m = int(inputData[1])